{
  "title": "Apps > Install this site as an app",
  "tags": null,
  "publish_date": "2020-01-29 11:45",
  "updated_date": null,
  "featured": false,
  "author": "Steven Ng",
  "__content": "\n# Confessions of a Tab Hoarder\n\nI've been using [Edge Chromium](https://www.microsoft.com/en-us/edge) as my primary browser on Windows for quite some time now, and I like it *a lot*. In the past few months, I don't think I've opened up Chrome on Windows except by mistake. Honestly, I don't miss Chrome at all.\n\nI've always had a bad habit of having too many tabs open (often more than 50). More often than not, instead of trying to find an existing tab, I'll just open a duplicate, which exacerbates my problem.\n\n# Roll Your Own PWA\n\nEdge has a very cool feature that lets you roll your own PWA ([progressive web application](https://developer.microsoft.com/en-us/windows/pwa)) out of a web site. In other words, it will create a single-site application that is accessible from the Windows Start menu. It also means that the generated PWA gets its own spot on your taskbar, using the site's [favicon](https://en.wikipedia.org/wiki/Favicon) as the icon. No more tab hunting.\n\nFor a tab hoarder like me, this is a life changing feature. I have a ton of web apps that I'm constantly using throughout the day, so this makes life a lot easier.\n\nAs always, there's a catch. The feature doesn't work great with all sites/web apps. If the web app you're using has to proliferate new tabs or windows, it's not a great candidate, as those tabs/windows will open up in Edge. For example, if you're thinking this technique is a great way to use Dropbox Paper or Google Apps<sup>1</sup>, you're wrong.\n\nOn the other hand, if you're using it for something like Feedly, Github or PGAdmin4, it's great. I have a lot of containerized web apps like [PiHole](https://pi-hole.net/) that work great as PWAs.\n\nSo how do you enable this magical feature?\n\nIf you're running Edge for Chromium, just browse to a site (ideally, you go to the exact page you want to start from, since that will be the page you see when launching the PWA), go to the menu, `Apps` > `Install this site as an app`. Give the app a new name if the default isn't to your liking, and **bam**, you're done!\n\n# Footnotes\n\n1. If you're looking for a way to handle multiple Google accounts for email and calendaring, check out [Easymail for Gmail](https://easymailforgmail.com/). I bought a license during the 1.x days, and it was fine but not something I could use daily. The latest release, 2.x, is a complete rewrite, and works much better than the previous iteration. Full disclosure, I wasn't paid to say that.\n",
  "html": "<h1 id=\"confessions-of-a-tab-hoarder\">Confessions of a Tab Hoarder</h1>\n<p>I&#39;ve been using <a href=\"https://www.microsoft.com/en-us/edge\">Edge Chromium</a> as my primary browser on Windows for quite some time now, and I like it <em>a lot</em>. In the past few months, I don&#39;t think I&#39;ve opened up Chrome on Windows except by mistake. Honestly, I don&#39;t miss Chrome at all.</p>\n<p>I&#39;ve always had a bad habit of having too many tabs open (often more than 50). More often than not, instead of trying to find an existing tab, I&#39;ll just open a duplicate, which exacerbates my problem.</p>\n<h1 id=\"roll-your-own-pwa\">Roll Your Own PWA</h1>\n<p>Edge has a very cool feature that lets you roll your own PWA (<a href=\"https://developer.microsoft.com/en-us/windows/pwa\">progressive web application</a>) out of a web site. In other words, it will create a single-site application that is accessible from the Windows Start menu. It also means that the generated PWA gets its own spot on your taskbar, using the site&#39;s <a href=\"https://en.wikipedia.org/wiki/Favicon\">favicon</a> as the icon. No more tab hunting.</p>\n<p>For a tab hoarder like me, this is a life changing feature. I have a ton of web apps that I&#39;m constantly using throughout the day, so this makes life a lot easier.</p>\n<p>As always, there&#39;s a catch. The feature doesn&#39;t work great with all sites/web apps. If the web app you&#39;re using has to proliferate new tabs or windows, it&#39;s not a great candidate, as those tabs/windows will open up in Edge. For example, if you&#39;re thinking this technique is a great way to use Dropbox Paper or Google Apps<sup>1</sup>, you&#39;re wrong.</p>\n<p>On the other hand, if you&#39;re using it for something like Feedly, Github or PGAdmin4, it&#39;s great. I have a lot of containerized web apps like <a href=\"https://pi-hole.net/\">PiHole</a> that work great as PWAs.</p>\n<p>So how do you enable this magical feature?</p>\n<p>If you&#39;re running Edge for Chromium, just browse to a site (ideally, you go to the exact page you want to start from, since that will be the page you see when launching the PWA), go to the menu, <code>Apps</code> &gt; <code>Install this site as an app</code>. Give the app a new name if the default isn&#39;t to your liking, and <strong>bam</strong>, you&#39;re done!</p>\n<h1 id=\"footnotes\">Footnotes</h1>\n<ol>\n<li>If you&#39;re looking for a way to handle multiple Google accounts for email and calendaring, check out <a href=\"https://easymailforgmail.com/\">Easymail for Gmail</a>. I bought a license during the 1.x days, and it was fine but not something I could use daily. The latest release, 2.x, is a complete rewrite, and works much better than the previous iteration. Full disclosure, I wasn&#39;t paid to say that.</li>\n</ol>\n",
  "timestamp": "2020-01-29T16:45:00.000Z",
  "year": 2020,
  "month": 1,
  "month_name": "January",
  "day": 29,
  "slug": "apps-install-this-site-as-an-app"
}
