{
  "title": "Cognos Bug of the Day",
  "tags": null,
  "publish_date": "2021-02-04 12:30",
  "updated_date": null,
  "featured": false,
  "author": "Steven Ng",
  "__content": "\r\n\r\nExperienced a nice juicy user interface bug in the Administration Console today. It's pretty obscure and specific, but knowing about it will prevent you from chasing down the wrong paths in terms of root cause analysis.\r\n\r\nThis little UI issue is a sanity breaker though, as it will have you second guessing what you did.\r\n\r\nStandard checkbox behaviour in a web browser is that [clicking on the label for a checkbox](https://svelte.dev/repl/cec15802392e470eb12efc01ac646ab0?version=3.32.1) will toggle its state from checked to unchecked and vice versa. Since the label is usually a much bigger target to click on than the checkbox, you might prefer to click on the label over the checkbox itself. \r\n\r\nIn the Cognos Administration console, if you click on a checkbox's label to **disable** an entry, it works perfectly fine. But if you click on the checkbox's label to **enable** an item, it doesn't save the change. Note that the \"Hide this entry\" checkbox value saves fine, so it is isolated to the \"Disable this entry\" checkbox label.\r\n\r\n\r\n<br/>\r\n<img src=\"images/2021/02/Cognos_Disable_Checkbox.png\" alt=\"Cognos Properties Page\">\r\n\r\n\r\nYour first thought is likely to be \"Well, this feature has been around forever, they've tested all edge cases. It can't be a UI bug, since I did the same thing to enable it and it worked.\"  You might be thinking maybe it's a permissions or capabilities issue. Surprise, surprise, it is indeed a user interface bug (reproducible in 11.1.7 and 11.1.4).\r\n\r\nSo let me save you a bit of time hunting this issue down, because searching for \"Cognos 11 can't enable printer\" or whichever item you're trying to enable probably won't give you a very good result (unless this blog post shows up, haha).\r\n\r\nLucky for us, there is a workaround. You can re-enable the item by clicking on **the checkbox itself** and then saving. \r\n\r\nI'm not in the habit of figuring out someone else's bugs, but curiosity got the best of me, so I looked at the markup in my browser's developer tools. If you're not into coding, you'll probably want to skip the next bit and be on your merry way.\r\n\r\nIt looks like the checkbox is inside a table, and when you click outside of the checkbox, the `<table>` tag has an `onclick` event that changes state of the checkbox (it wasn't the label after all). The problem is that the value is tracked not in the checkbox control, but in a hidden text field (which is storing the value being saved to the content store), and that field isn't changed to `false` when the \"Disable this entry\" checkbox is checked (it is for the \"Hide this Entry\" table click though).\r\n\r\nI'm sure the markup is quite old (the heavy use of tables is a good indicator), as backwards compatibility with Internet Explorer is still a thing in the enterprise world, even today. Having said that, by modern web coding standards, the amount of code being used to manage a boolean state on a checkbox is absolutely bonkers.\r\n",
  "html": "<p>Experienced a nice juicy user interface bug in the Administration Console today. It&#39;s pretty obscure and specific, but knowing about it will prevent you from chasing down the wrong paths in terms of root cause analysis.</p>\n<p>This little UI issue is a sanity breaker though, as it will have you second guessing what you did.</p>\n<p>Standard checkbox behaviour in a web browser is that <a href=\"https://svelte.dev/repl/cec15802392e470eb12efc01ac646ab0?version=3.32.1\">clicking on the label for a checkbox</a> will toggle its state from checked to unchecked and vice versa. Since the label is usually a much bigger target to click on than the checkbox, you might prefer to click on the label over the checkbox itself. </p>\n<p>In the Cognos Administration console, if you click on a checkbox&#39;s label to <strong>disable</strong> an entry, it works perfectly fine. But if you click on the checkbox&#39;s label to <strong>enable</strong> an item, it doesn&#39;t save the change. Note that the &quot;Hide this entry&quot; checkbox value saves fine, so it is isolated to the &quot;Disable this entry&quot; checkbox label.</p>\n<br/>\n<img src=\"images/2021/02/Cognos_Disable_Checkbox.png\" alt=\"Cognos Properties Page\">\n\n\n<p>Your first thought is likely to be &quot;Well, this feature has been around forever, they&#39;ve tested all edge cases. It can&#39;t be a UI bug, since I did the same thing to enable it and it worked.&quot;  You might be thinking maybe it&#39;s a permissions or capabilities issue. Surprise, surprise, it is indeed a user interface bug (reproducible in 11.1.7 and 11.1.4).</p>\n<p>So let me save you a bit of time hunting this issue down, because searching for &quot;Cognos 11 can&#39;t enable printer&quot; or whichever item you&#39;re trying to enable probably won&#39;t give you a very good result (unless this blog post shows up, haha).</p>\n<p>Lucky for us, there is a workaround. You can re-enable the item by clicking on <strong>the checkbox itself</strong> and then saving. </p>\n<p>I&#39;m not in the habit of figuring out someone else&#39;s bugs, but curiosity got the best of me, so I looked at the markup in my browser&#39;s developer tools. If you&#39;re not into coding, you&#39;ll probably want to skip the next bit and be on your merry way.</p>\n<p>It looks like the checkbox is inside a table, and when you click outside of the checkbox, the <code>&lt;table&gt;</code> tag has an <code>onclick</code> event that changes state of the checkbox (it wasn&#39;t the label after all). The problem is that the value is tracked not in the checkbox control, but in a hidden text field (which is storing the value being saved to the content store), and that field isn&#39;t changed to <code>false</code> when the &quot;Disable this entry&quot; checkbox is checked (it is for the &quot;Hide this Entry&quot; table click though).</p>\n<p>I&#39;m sure the markup is quite old (the heavy use of tables is a good indicator), as backwards compatibility with Internet Explorer is still a thing in the enterprise world, even today. Having said that, by modern web coding standards, the amount of code being used to manage a boolean state on a checkbox is absolutely bonkers.</p>\n",
  "timestamp": "2021-02-04T17:30:00.000Z",
  "year": 2021,
  "month": 2,
  "month_name": "February",
  "day": 4,
  "slug": "cognos-bug-of-the-day-2021-02-04"
}
