{
  "title": "My SARS-CoV-2/COVID-10 Links article is up",
  "tags": null,
  "publish_date": "2020-03-20 12:00",
  "updated_date": null,
  "featured": false,
  "author": "Steven Ng",
  "__content": "\n\nThe mass spread of the SARS-CoV-2 virus in March 2020 effectively changed the world. We are seeing reactions at both extremes - panic and dismissal. Personally, I think a huge part of this is related to communication. The traditional news and media organizations have done a satisfactory job of *reporting* events, but not as good a job at *educating* people on just about everything.\n\nFortunately, many individuals have stepped up and provided better informative sources than the ones you'll get by watching the news or reading newspapers.\n\n[I have posted an article with links](/articles/covid-info) that I consider to be of high quality as it relates to the pandemic.\n\nAs I find new quality content, I'll add it to that article.\n\nLet's be safe everyone, we *will* get through this.\n",
  "html": "<p>The mass spread of the SARS-CoV-2 virus in March 2020 effectively changed the world. We are seeing reactions at both extremes - panic and dismissal. Personally, I think a huge part of this is related to communication. The traditional news and media organizations have done a satisfactory job of <em>reporting</em> events, but not as good a job at <em>educating</em> people on just about everything.</p>\n<p>Fortunately, many individuals have stepped up and provided better informative sources than the ones you&#39;ll get by watching the news or reading newspapers.</p>\n<p><a href=\"/articles/covid-info\">I have posted an article with links</a> that I consider to be of high quality as it relates to the pandemic.</p>\n<p>As I find new quality content, I&#39;ll add it to that article.</p>\n<p>Let&#39;s be safe everyone, we <em>will</em> get through this.</p>\n",
  "timestamp": "2020-03-20T16:00:00.000Z",
  "year": 2020,
  "month": 3,
  "month_name": "March",
  "day": 20,
  "slug": "covid-article-up"
}
