{
  "title": "Welcome to the New Site",
  "tags": null,
  "publish_date": "2020-01-01 12:00",
  "featured": false,
  "author": "Steven Ng",
  "__content": "\r\n\r\nWell it's been a while since the site has been updated. A *long* while, actually.\r\n\r\nIt's been a long time coming, but I forced myself over the holidays to revamp the site, and here it is.\r\n\r\nThings are going to be rough for a little while, as this is a work in progress, and I've opted to go live with a buggy site as opposed to leaving a placeholder page up. This should force me to iterate more quickly and more often.\r\n\r\nSo before I rebuilt the site, I went through a lot of hand-wringing deciding how to publish this site.\r\n\r\nShould I use a static generator like Jekyll? A GUI type tool like MarsEdit? Should I write my own tool? Wordpress (no f-ing way)? A hosted site like Squarespace?\r\n\r\nI ended up choosing a hodgepodge of [Svelte](https://svelte.dev/) and [Sapper](https://sapper.svelte.dev/), with some preprocessing using [Gulp](https://gulpjs.com/). I've already been immersing myself in Svelte for the past couple of months, so I figured I may as well stick with that for my site too. Once the site is somewhat stable, I'll try to write up a blog post on what I do to build this site. TLDR; I basically write my content as markdown posts, and have a script to process them into something consumable for my Svelte app.\r\n\r\nThe site's main focus is the blog, but I will have some evergreen content in the form of articles that can help boost your productivity. I plan to publish my list of \"must have\" software and services, among other things.\r\n\r\nThe blog will be mostly made up of a hodgepodge of technical topics, ranging from Cognos, Node, Database and other topics that I find interesting.\r\n\r\nIn the meantime, click on the RSS link at the top of the page to keep up with my new content.\r\n\r\nCheers!\r\n",
  "html": "<p>Well it&#39;s been a while since the site has been updated. A <em>long</em> while, actually.</p>\n<p>It&#39;s been a long time coming, but I forced myself over the holidays to revamp the site, and here it is.</p>\n<p>Things are going to be rough for a little while, as this is a work in progress, and I&#39;ve opted to go live with a buggy site as opposed to leaving a placeholder page up. This should force me to iterate more quickly and more often.</p>\n<p>So before I rebuilt the site, I went through a lot of hand-wringing deciding how to publish this site.</p>\n<p>Should I use a static generator like Jekyll? A GUI type tool like MarsEdit? Should I write my own tool? Wordpress (no f-ing way)? A hosted site like Squarespace?</p>\n<p>I ended up choosing a hodgepodge of <a href=\"https://svelte.dev/\">Svelte</a> and <a href=\"https://sapper.svelte.dev/\">Sapper</a>, with some preprocessing using <a href=\"https://gulpjs.com/\">Gulp</a>. I&#39;ve already been immersing myself in Svelte for the past couple of months, so I figured I may as well stick with that for my site too. Once the site is somewhat stable, I&#39;ll try to write up a blog post on what I do to build this site. TLDR; I basically write my content as markdown posts, and have a script to process them into something consumable for my Svelte app.</p>\n<p>The site&#39;s main focus is the blog, but I will have some evergreen content in the form of articles that can help boost your productivity. I plan to publish my list of &quot;must have&quot; software and services, among other things.</p>\n<p>The blog will be mostly made up of a hodgepodge of technical topics, ranging from Cognos, Node, Database and other topics that I find interesting.</p>\n<p>In the meantime, click on the RSS link at the top of the page to keep up with my new content.</p>\n<p>Cheers!</p>\n",
  "timestamp": "2020-01-01T17:00:00.000Z",
  "year": 2020,
  "month": 1,
  "month_name": "January",
  "day": 1,
  "slug": "welcome-to-the-new-site"
}
